app/views/yandex_translates/_form.html.slim

SELECT "translates".* FROM "translates"
---
    br
    - @detect_lang = Translate::Yandex_langs.keys.first if @detect_lang.to_s.empty?