app/controllers/yandex_translates_controller.rb

  def index
    @translates = Translate.all
---
SELECT "translates".* FROM "translates"

  def show
    @translate = Translate.find(params[:id])
---
SELECT  "translates".* FROM "translates" WHERE "translates"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @translate = Translate.find(params[:id])
---
SELECT  "translates".* FROM "translates" WHERE "translates"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @translate = Translate.new(translate_params)

    if @translate.save
---
INSERT INTO "translates" ("text", "translated_text", "lang", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "hello"], ["translated_text", "bonjour"], ["lang", "en-fr"], ["created_at", "2015-11-06 08:21:37.860930"], ["updated_at", "2015-11-06 08:21:37.860930"]]

  def update
    @translate = Translate.find(params[:id])

    if @translate.update(translate_params)
---
SELECT  "translates".* FROM "translates" WHERE "translates"."id" = ? LIMIT 1  [["id", 16]]
UPDATE "translates" SET "text" = ?, "translated_text" = ?, "lang_short" = ?, "lang_long" = ?, "updated_at" = ? WHERE "translates"."id" = ?  [["text", "hello"], ["translated_text", "Hallo"], ["lang_short", "en-de"], ["lang_long", "English - German"], ["updated_at", "2015-11-07 16:16:06.148991"], ["id", 9]]

  def destroy
    @translate = Translate.find(params[:id])
    @translate.destroy
---
SELECT  "translates".* FROM "translates" WHERE "translates"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "translates" WHERE "translates"."id" = ?  [["id", 1]]